{"config": {"name": "model_1", "layers": [{"name": "input_2", "config": {"name": "input_2", "batch_input_shape": [null, 1], "sparse": false, "dtype": "float32"}, "class_name": "InputLayer", "inbound_nodes": []}, {"name": "input_3", "config": {"name": "input_3", "batch_input_shape": [null, 1], "sparse": false, "dtype": "float32"}, "class_name": "InputLayer", "inbound_nodes": []}, {"name": "embedding_1", "config": {"embeddings_initializer": {"config": {"seed": null, "minval": -0.05, "maxval": 0.05}, "class_name": "RandomUniform"}, "activity_regularizer": null, "mask_zero": false, "batch_input_shape": [null, null], "input_dim": 370, "name": "embedding_1", "input_length": null, "embeddings_constraint": null, "trainable": true, "output_dim": 1, "embeddings_regularizer": null, "dtype": "float32"}, "class_name": "Embedding", "inbound_nodes": [[["input_2", 0, 0, {}]]]}, {"name": "embedding_2", "config": {"embeddings_initializer": {"config": {"seed": null, "minval": -0.05, "maxval": 0.05}, "class_name": "RandomUniform"}, "activity_regularizer": null, "mask_zero": false, "batch_input_shape": [null, null], "input_dim": 370, "name": "embedding_2", "input_length": null, "embeddings_constraint": null, "trainable": true, "output_dim": 1, "embeddings_regularizer": null, "dtype": "float32"}, "class_name": "Embedding", "inbound_nodes": [[["input_3", 0, 0, {}]]]}, {"name": "flatten_1", "config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten", "inbound_nodes": [[["embedding_1", 0, 0, {}]]]}, {"name": "flatten_2", "config": {"name": "flatten_2", "trainable": true}, "class_name": "Flatten", "inbound_nodes": [[["embedding_2", 0, 0, {}]]]}, {"name": "input_1", "config": {"name": "input_1", "batch_input_shape": [null, 9], "sparse": false, "dtype": "float32"}, "class_name": "InputLayer", "inbound_nodes": []}, {"name": "concatenate_1", "config": {"name": "concatenate_1", "trainable": true, "axis": -1}, "class_name": "Concatenate", "inbound_nodes": [[["flatten_1", 0, 0, {}], ["flatten_2", 0, 0, {}]]]}, {"name": "concatenate_2", "config": {"name": "concatenate_2", "trainable": true, "axis": -1}, "class_name": "Concatenate", "inbound_nodes": [[["input_1", 0, 0, {}], ["concatenate_1", 0, 0, {}]]]}, {"name": "dense_1", "config": {"activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "activation": "relu", "name": "dense_1", "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "trainable": true, "kernel_regularizer": null, "use_bias": true, "units": 10}, "class_name": "Dense", "inbound_nodes": [[["concatenate_2", 0, 0, {}]]]}, {"name": "dense_2", "config": {"activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "activation": "relu", "name": "dense_2", "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "trainable": true, "kernel_regularizer": null, "use_bias": true, "units": 10}, "class_name": "Dense", "inbound_nodes": [[["dense_1", 0, 0, {}]]]}, {"name": "dense_3", "config": {"activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "activation": "relu", "name": "dense_3", "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "trainable": true, "kernel_regularizer": null, "use_bias": true, "units": 10}, "class_name": "Dense", "inbound_nodes": [[["dense_2", 0, 0, {}]]]}, {"name": "dense_4", "config": {"activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "activation": "softmax", "name": "dense_4", "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "trainable": true, "kernel_regularizer": null, "use_bias": true, "units": 3}, "class_name": "Dense", "inbound_nodes": [[["dense_3", 0, 0, {}]]]}], "input_layers": [["input_1", 0, 0], ["input_2", 0, 0], ["input_3", 0, 0]], "output_layers": [["dense_4", 0, 0]]}, "keras_version": "2.0.6", "backend": "tensorflow", "class_name": "Model"}